{
  "name": "Rotorua",
  "country": "New Zealand",
  "fun_fact": "Fun fact: Rotorua sits on one of the world's most active geothermal zones - M캐ori have cooked using underground steam vents (h캐ngi) for over 700 years, and you can still see natural hot pools where locals boil eggs and corn right beside the sidewalk!",
  "food_and_drink": {
    "hero_dishes": [
      {
        "name": "H캐ngi",
        "description": "Traditional M캐ori feast cooked underground using geothermally heated rocks - meat and vegetables steam for hours wrapped in flax leaves",
        "origin_story": "700+ years of tradition. In Rotorua, natural geothermal heat provides the cooking energy. The food absorbs earthy, smoky flavors from the ground",
        "where_to_find": "Te Puia, Tamaki M캐ori Village, Whakarewarewa The Living M캐ori Village, Mitai M캐ori Village"
      },
      {
        "name": "Rewena Bread",
        "description": "M캐ori sourdough bread made with a potato-based starter (bug)",
        "origin_story": "Pre-European M캐ori adapted bread-making using potatoes for the starter. Slightly sweet and dense",
        "where_to_find": "M캐ori cultural experiences, local bakeries, farmers markets"
      },
      {
        "name": "Geothermal Corn and Eggs",
        "description": "Corn and eggs cooked in natural hot spring water",
        "origin_story": "Locals use the natural hot pools as cooking pots - you can see this happening at Kuirau Park in the city center",
        "where_to_find": "Kuirau Park hot springs, Hell's Gate, Whakarewarewa village"
      },
      {
        "name": "Kaimoana (Seafood)",
        "description": "Fresh New Zealand seafood including green-lipped mussels, crayfish, and paua",
        "origin_story": "Though inland, Rotorua restaurants source excellent seafood from nearby coasts",
        "where_to_find": "Stratosfare Restaurant (with gondola views), Capers Epicurean, Pig & Whistle"
      }
    ],
    "signature_drinks": [
      {
        "name": "L&P",
        "description": "Lemon & Paeroa - 'World Famous in New Zealand' soft drink",
        "how_locals_drink_it": "The quintessential Kiwi drink, often with fish and chips"
      },
      {
        "name": "Manuka Honey Drinks",
        "description": "Hot drinks and cocktails featuring local Manuka honey",
        "how_locals_drink_it": "In tea, or in craft cocktails at local bars"
      }
    ],
    "food_culture_notes": [
      "Rotorua is the best place in NZ to experience authentic M캐ori food culture",
      "The sulfur smell is strong but you get used to it - locals call it 'Sulphur City'",
      "Night h캐ngi experiences combine feast with cultural performance",
      "Local trout fishing is excellent - restaurants cook your catch"
    ]
  },
  "visual_elements": {
    "landmarks": [
      "Te Puia geysers",
      "Whakarewarewa geothermal valley",
      "Government Gardens",
      "Lake Rotorua"
    ],
    "atmosphere": [
      "steam rising everywhere",
      "M캐ori cultural sites",
      "bubbling mud pools",
      "sulfur smell"
    ],
    "colors": [
      "geothermal white",
      "mud pool grey",
      "silica terrace orange",
      "fern green"
    ],
    "unique_modern": [
      "adventure tourism capital",
      "mountain biking trails",
      "zorbing origin"
    ]
  },
  "wikipedia_search_term": "Rotorua",
  "keywords_for_image": [
    "h캐ngi earth oven",
    "geothermal steam",
    "M캐ori carving",
    "hot springs",
    "mud pools",
    "geysers"
  ],
  "coordinates": {
    "lat": -38.1368,
    "lng": 176.2497
  },
  "links": {
    "google_maps": "https://www.google.com/maps/place/Rotorua+游游/@-38.1368,176.2497,12z",
    "wikipedia": "https://en.wikipedia.org/wiki/Rotorua"
  },
  "location_id": 188
}